[
    {
        "reviews": [
            {
                "review_header": "Best phone I have owned with Boostmobile!", 
                "review_text": "I love this Samsung J7, since it is bigger than the s6 and s7, and as good as my old S5 (as compared in the images). I had no issues charging it or switching it over from old phone to this new phone - via a 4 minute phone call to Boostmobile. Yes, the S6 and S7 have -much- faster processors, but I do not need that for what I do... and so far, after 1 month of use, I absolutely love this phone!. The phone feels great, responds quickly, and looks freaking awesome. Pros: -Great price -AFFORDABLE! -Bigger than most other phones available -Great quality screen Cons: -2 bottom buttons- on side of the main home button- DO NOT light up -Camera is not comparable to that of the S5, S6, and S7 -Overall quality does not feel as sturdy as the other models mentioned (Shell plastic is thinner). After one month of use, I rated this phone with 4 stars. I will be updating this review in about 6 months. REVIEW UPDATE: February 19, 2017 After eight (8) months of owning this phone, and 7 months since this original review, I am back today to continue my review as promised. I am doing 2 things for those of you who are reading this review for the first time: 1) I have added a star to make this a 5 star review! 2) I will explain why I have decided to come back to add this star to my review. Let me clarify that since reviewing this, I have purchased a second one for my wife. I will also list what items I purchased it along with: Mr Shield Tempered Glass Screen Protector for Samsung Galaxy J7 [Will Not Fit For 2016 Version] - 2-Pack Samsung EVO 64GB Micro SDXC Memory Card with Adapter up to 48/MB/s (MB-MP64DA/AM) Phonelicious SAMSUNG Galaxy J7 Case(Boost,Virgin,TMobile,Metro PCS)Slim Fit Heavy Duty Ultimate Drop Protection Rugged Cover with Screen Protector & Stylus (Navy Blue Matte) Of course, purchasing a case, the Screen protector, and a good quality memory card may also influence how this product has performed. This phone continues to work as expected, and has delivered so far. I feel my investment on this phone has paid off, and my money has been worth. Being a somewhat frugal shopper, I thought I would give this phone a try to since it's price was reasonable for what I was getting. My 1 year old (who is now 18 months) has used and abused this phone. He has thrown it on the floor dozens of times, and has scratched, as well chewed on it. What has happened to the phone so far? - It has gained a large crack, on the screen protector. The phone is still working as it did 8 months ago, and the cheap items I purchased to protected have taken quite the toll. I had originally mentioned that the phone felt \"cheap\", and the thin plastic that it is made out of, is certainly noticeable compared to the quality of the S5, and other S series for that matter. Given that this phone has performed well, continues to deliver, and has outlasted quite some abuse, I made the judgement to give this phone the extra star, since this is a great product to my standards. I plan to come back in June, and review this item again after a full year of use!", 
                "review_comment_count": "7", 
                "review_posted_date": "19 Jul 2016", 
                "review_rating": "5.0 ", 
                "review_author": " JLO"
            }, 
            {
                "review_header": "Very good phone for the money", 
                "review_text": "I bought this phone from boost Mobile website for 200 bucks. Of course its not as good as the s7, but if you don't wanna spend 700$ for a phone, then you can't go wrong with j7. Very good phone for the money. I already bought a couple spare batteries. Pros- Good price, good call quality, fast internet, good camera, good selfie camera, great display, perfect size, great for texting, Great battery life (leave it on power save mode), good speaker, 6.0 marshmallow is great, Cons- No LED notification light, incoming ring tone couple be louder.", 
                "review_comment_count": "3", 
                "review_posted_date": "13 May 2016", 
                "review_rating": "4.0 ", 
                "review_author": " Frankie"
            }, 
            {
                "review_header": "GORGEOUS phone .... I'm in love with it!", 
                "review_text": "I love this Samsung J7. I couldn't afford the sticker price for the S6 or S7 (sticker shock!). Therefore; I opted for this which is scaled down in terms of processing/memory BUT it's much better quality than the phone I was using for my Boost Mobile account. I had no issues charging it or switching it over from old phone to this new phone - via my online account (I didn't have to talk to anybody to do this and it worked out just great). My hubby has the Samsung S6 which he saved/paid for upfront (no contract at Boost Mobile). Comparing my new J7 to his S6 - well; apples to oranges. His has 2 processors (a quad-core and an octa-core). This J7 has just the octa-core BUT for me is proving to be plenty of processing power along with the 2GB ROM. This was pretty comparable to the ZTE Warp Elite I've been using since January 2016 but I'd have to say that the Samsung is much faster - also that the screen response is so much better in this J7 model (even with the glass protection I placed on the screen). My hubby bought me this for my upcoming 60th birthday! GREAT present for me.....all mine! Thank you 'shopcelldeals' for selling this at a reasonable price that was affordable. Recommended.", 
                "review_comment_count": "", 
                "review_posted_date": "06 May 2016", 
                "review_rating": "5.0 ", 
                "review_author": " CMarie"
            }, 
            {
                "review_header": "Worth it.", 
                "review_text": "I love this phone! Coming from the galaxy S3 for Boost this is a big jump in the right direction. $20 cheaper on amazon than the boost mobile site another plus.The battery last all day. That is while talking/texting using apps. It is two times bigger than the S3 but def worth it. The operating system is much faster and more responsive as well.", 
                "review_comment_count": "", 
                "review_posted_date": "19 Nov 2016", 
                "review_rating": "5.0 ", 
                "review_author": " TG"
            }, 
            {
                "review_header": "This is a great phone for Boost Mobile", 
                "review_text": "This is a great phone for Boost Mobile. I have had it a few months and it's been great. Much nicer than my old one and the big screen has spoiled me. The iPhone 6 I use for work is tiny by comparison and I much prefer this phone over the iPhone.", 
                "review_comment_count": "", 
                "review_posted_date": "06 Oct 2016", 
                "review_rating": "5.0 ", 
                "review_author": " David Erickson"
            }, 
            {
                "review_header": "Love the phone", 
                "review_text": "Awesome phone for the price. Face it, these are not the S7 phones but a cheaper version. I have no problem with them at all. Plenty of memory and large screen. I love the phone. You are getting a Marshmallow system which should keep me going for a couple of years. Boost mobile is like every other cell company. Hard to deal with on the phone but once the service is set up, no problems. Fast 4gLTE.", 
                "review_comment_count": "", 
                "review_posted_date": "05 Jul 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Leesaa"
            }, 
            {
                "review_header": "Five Stars", 
                "review_text": "love this phone! such a more affordable option. It transfered right over on my boost account, very pleased", 
                "review_comment_count": "", 
                "review_posted_date": "26 Jul 2016", 
                "review_rating": "5.0 ", 
                "review_author": " Andrea Armstrong"
            }, 
            {
                "review_header": "Easy to read and send text messages", 
                "review_text": "Easy to read and send text messages. Great camera. I don't use it for the internet really, but I am very happy with it.", 
                "review_comment_count": "", 
                "review_posted_date": "23 Aug 2016", 
                "review_rating": "5.0 ", 
                "review_author": " GardenBug Lad"
            }
        ], 
        "ratings": {
            "2 star": "2%", 
            "1 star": "9%", 
            "4 star": "17%", 
            "3 star": "4%", 
            "5 star": "68%"
        }, 
        "price": "$147.99", 
        "url": "http://www.amazon.com/dp/B01ETPUQ6E", 
        "name": "Samsung Galaxy J7 No Contract Phone,  16GB ROM/2GB ROM, 5.5 Inch - White - (Boost Mobile)"
    }
]